app/controllers/mixtapes_controller.rb

  def create
    mixtape = Mixtape.create mixtape_params
---
INSERT INTO "mixtapes" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "some jam"], ["created_at", "2020-10-16 00:47:24.252934"], ["updated_at", "2020-10-16 00:47:24.252934"]]